import pandas as pd

"""
df = pd.DataFrame({
    'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square': [2724902, 17125191, 207600, 603628]
}, index=['KZ', 'RU', 'BY', 'UA'])

print(df)
print()

Обращение к полям:
print(df['country'])
print()
print(df['country'].loc['KZ'])
print()
print(df.loc['KZ']['country'])
print()
print(df.loc['KZ'])
"""
tab_а = pd.DataFrame({63: [100, 107, 109, 100, 106, 105, 110, 113, 101, 99],
                      125: [99, 105, 111, 103, 104, 106, 109, 110, 103, 115],
                      250: [98, 107, 109, 102, 104, 107, 103, 113, 104, 117],
                      500: [100, 106, 110, 97, 113, 99, 110, 114, 107, 123],
                      1000: [102, 101, 100, 90, 99, 96, 111, 112, 110, 123],
                      2000: [101, 100, 97, 88, 95, 92, 105, 109, 109, 121],
                      4000: [95, 97, 91, 85, 86, 89, 14, 107, 104, 117],
                      8000: [88, 88, 85, 79, 79, 85, 102, 100, 95, 107], },
                     index=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
print(tab_а)

tab_б = pd.DataFrame({1: [15, 10, 4],
                      2: [15, 15, 4],
                      3: [25, 15, 6],
                      4: [50, 30, 4],
                      5: [60, 30, 6],
                      6: [20, 15, 6],
                      7: [9, 7, 4],
                      8: [18, 10, 6],
                      9: [24, 18, 6],
                      10: [20, 10, 6], },
                     index=['длина', 'ширина', 'высота', ])
print(tab_б)

tab_в = pd.DataFrame({63: [104, 107, 88, 108, 111, 101, 103, 96, 98, 100],
                      125: [110, 111, 91, 115, 113, 106, 110, 101, 100, 95],
                      250: [113, 108, 93, 115, 113, 104, 108, 101, 105, 95],
                      500: [106, 104, 96, 113, 118, 106, 107, 91, 100, 103],
                      1000: [100, 101, 90, 112, 117, 105, 99, 95, 100, 107],
                      2000: [96, 104, 93, 113, 115, 95, 85, 96, 97, 109],
                      4000: [94, 98, 86, 106, 110, 90, 81, 94, 95, 108],
                      8000: [91, 94, 77, 96, 106, 80, 81, 93, 90, 107], },
                     index=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
print(tab_в)

tab_г = pd.DataFrame({1: [4, 10],
                      2: [4, 15],
                      3: [6, 15],
                      4: [6, 20],
                      5: [6, 25],
                      6: [6, 30],
                      7: [6, 22],
                      8: [4, 9],
                      9: [4, 16],
                      10: [6, 16], },
                     index=['длина', 'высота'])
print(tab_г)

tab_д = pd.DataFrame({63: [100],
                      125: [120],
                      250: [130],
                      500: [130],
                      1000: [130],
                      2000: [125],
                      4000: [115],
                      8000: [110], },
                     index=['Уровень звукового давления, дБ'])
print(tab_д)

tab_е = pd.DataFrame({1: [2, 1, 3],
                      2: [2.5, 1.5, 3],
                      3: [3, 2, 4],
                      4: [2, 1.5, 2],
                      5: [2, 2, 3],
                      6: [2, 1.5, 3],
                      7: [2.5, 2, 3],
                      8: [3, 2, 4],
                      9: [2, 2, 4],
                      10: [2, 2, 3], },
                     index=['l', 'b', 'h', ])
print(tab_е)
list_1 = [
    "Помещения конструкторских бюро, расчетчиков, программистов вычислительных машин, лабораторий для теоретических работ",
    "Помещения управления, рабочие комнаты", "- без речевой связи по телефону", "- с речевой связью по телефону",
    "Помещения и участки точной сборки, машинописные бюро",
    "Помещения лабораторий для проведения экспериментальных работ, для размещения шумных агрегатов, вычислительных машин",
    "Постоянные рабочие места и рабочие зоны в производственных помещениях и на территории предприятия"]
tab_1 = pd.DataFrame({31.5: [86, 93, 103, 96, 96, 107, 110],
                      63: [71, 79, 94, 83, 83, 94, 99],
                      125: [61, 70, 87, 74, 74, 87, 92],
                      250: [54, 68, 82, 68, 68, 82, 86],
                      500: [49, 58, 78, 63, 63, 78, 83],
                      1000: [455, 55, 75, 60, 60, 75, 8],
                      2000: [42, 52, 73, 57, 57, 73, 78],
                      4000: [40, 50, 71, 55, 55, 71, 76],
                      8000: [38, 49, 70, 54, 54, 70, 74], },
                     index=list_1)
print(tab_1)

list_2 = [
    "Машинные залы, генераторные, испытательные стенды, вентиля-ционные камеры, цехи предприятий пищевой промышленности с ограждениями, облицованными моющейся плиткой",
    "Механические и металлообрабатывающие цехи; цехи агрегатной сборки в авиационной и судостроительной промышленности",
    "Цехи деревообработки и предприятий текстильной промышленности; посты управления; лабораторий; конструкторские бюро; рабочие помещения управлений"]
tab_2 = pd.DataFrame({63: [0.07, 0.1, 0.11],
                      125: [0.08, 0.10, 0.11],
                      250: [0.08, 0.10, 0.12],
                      500: [0.08, 0.11, 0.13],
                      1000: [0.08, 0.12, 0.14],
                      2000: [0.08, 0.12, 0.14],
                      4000: [0.09, 0.12, 0.14],
                      8000: [0.09, 0.12, 0.14], },
                     index=list_2)
print(tab_2)

tab_3 = pd.DataFrame({125: [0.00015, 0.00015, 0.00015, 0.00014, 0.00014, 0.00014, 0.00014, 0.00014, 0.00014, 0.00014,
                            0.00014, 0.00014, ],
                      250: [0.0003, 0.0003, 0.0003, 0.00029, 0.00029, 0.00029, 0.00028, 0.00028, 0.00028, 0.00028,
                            0.00028, 0.00028],
                      500: [0.00064, 0.00062, 0.00060, 0.00059, 0.00058, 0.00057, 0.00056, 0.00055, 0.00055, 0.00055,
                            0.00055, 0.00055],
                      1000: [0.0012, 0.0011, 0.0010, 0.00095, 0.00080, 0.00075, 0.00070, 0.00065, 0.00063, 0.00061,
                             0.00060, 0.00058],
                      2000: [0.0032, 0.0028, 0.0027, 0.0025, 0.0024, 0.0023, 0.0022, 0.0021, 0.0020, 0.0020, 0.0020,
                             0.0020],
                      4000: [0.0095, 0.0082, 0.0075, 0.0065, 0.0061, 0.0057, 0.0055, 0.0050, 0.0051, 0.0050, 0.0049,
                             0.0048],
                      8000: [0.0340, 0.0290, 0.0270, 0.0230, 0.0215, 0.0190, 0.0182, 0.0164, 0.0156, 0.0142, 0.0138,
                             0.0124, ], },
                     index=[30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 90])
print(tab_3)
